[
	{
		"title": "Routes optimizations",
		"text": "<ul><li>Scheduling new appointments with route optimization in mind.</li><li>Minimizing the length of a route for multiple appointments.</li></ul>(Python, Flask, Leaflet, Google Maps and Agenda API)",
		"image": "https://i.postimg.cc/L6CMfd4s/routes.png",
		"more": {
			"video": "https://player.vimeo.com/video/908784269?badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479",
			"text": "This software is intended for my previous employer, Prop Lavage, but the project was developed with modularity in mind to accommodate other potential companies.<br><br>The backend is almost done; this frontend is a temporary minimalist implementation."
		}
	},
	{
		"title": "Snake Game",
		"text": "Simple game featuring a bot that utilizes the Dijkstra algorithm. When the apple is out of reach, the 'X' represents the most hopeful escape. The snake should zig-zag without blocking it. In progress.<br><br>(C++)",
		"image": "https://i.postimg.cc/MTLQMq9x/dijkstra-critical-point.gif",
		"repo": "https://github.com/francoismartineau/snake_game"
	},
	{
		"title": "Internship at Coyote Amérique",
		"text": "A web app designed for developers, functioning as a microservice among others, showcasing events flowing through gRPC and Kafka pipelines. It allows users to filter events in various ways. <br><br>(Go, Vue.js, Docker)",
		"image": "https://i.postimg.cc/855dF6Rf/coyote-tower.png",
		"more": {
			"images": ["https://i.postimg.cc/v8PCD5HF/coyote1.png",
				"https://i.postimg.cc/hPBMDjVW/coyote2.png",
				"https://i.postimg.cc/fbJf20QX/coyote3.png",
				"https://i.postimg.cc/wBZcST9r/coyote4.png"],
			"text": "This project is the result of an internship with the R&D team of Coyote Amérique. <a href=\"https://www.moncoyote.com/\" target=\"_blank\">Coyote</a> sells a driver assistant based on inputs from its community. Throughout the summer, I learned immensely and am grateful for the brilliant and generous colleagues who supported me. Subsequently, I was delighted to discover that developers from various divisions were still benefiting from my work."
		}
	},	
	{
		"title": "Web Scraper",
		"text": "Automatically shops on the web, seeking products with specific characteristics under a specified price threshold. When it finds a gem, a Sheets document is updated and I'm notified via email.<br><br>(Python, Selenium, Google APIs)",
		"image": "https://i.postimg.cc/QtmDqWfD/scraper2.png",
		"repo": "https://github.com/francoismartineau/scraper"
	},
	{
		"title": "Transactions parser",
		"text": "Automated personal finance analysis: The user inputs bank statements, and transactions are visually represented by category.<br><br>(Python, Tesseract-OCR, Google Sheets API)",
		"image": "https://i.postimg.cc/XvLdbSHg/Transactions.png",
		"repo": "https://github.com/francoismartineau/transactions"
	},
	{
		"title": "Web Game",
		"text": "A game designed for movie buffs to challenge their knowledge of their favorite films.<br><br>(Python, Flask, ffmpeg, Cloudinary API, html, js)",
		"image": "https://i.postimg.cc/hGhZYQ4g/Screen-Shot-2024-01-05-at-10-27-45-AM.png",
		"repo": "https://github.com/francoismartineau/moviesorter"
	},
	{
		"title": "Minishell",
		"text": "A shell that immitates Bash. It supports pipes, redirections, wildcards, tab completion and more! Developed as part of my studies with a colleague at 42 Québec.<br><br>(C)",
		"image": "https://i.postimg.cc/Kzv0JVYs/Screen-Shot-2024-01-05-at-4-18-46-PM.png",
		"repo": "https://github.com/Ethylia/minishell"
	},	
	{
		"title": "Map projection",
		"text": "A program that reads height data from a file and generates an isometric wireframe map. The slopes can be exaggerated and the map can be rotated with 90-degrees increments.<br><br>(C)",
		"image": "https://camo.githubusercontent.com/ee318a66980cabdb04f5aee59f77f2262a4a1774f6e964e713d468abd71eeac6/68747470733a2f2f692e706f7374696d672e63632f57626d524e4a5a6a2f53637265656e2d53686f742d323032342d30312d30342d61742d31312d35332d31352d414d2e706e67",
		"repo": "https://github.com/francoismartineau/42Fdf"
	},
	{
		"title": "FLahk",
		"text": "Enhances FL Studio, a popular music production software, by optimizing up the workflow and putting the user in unforseen situations, fostering creativity. This project reflects my passion for music, programming and experimentation.<br><br>(AutoHotKey, Python, ffmpeg)",
		"image": "https://i.postimg.cc/Jnhd9BC7/flahk.png",
		"more": {
			"text": "<b>Initial motivation:</b> When I returned to FL Studio, I realized many operations were repetitive and I wanted to speed things up by removing non creative steps. It started with macros, automating the mouse and keyboard and I ended up making the computer make more and more significant choices.<br><br><b>Philosophy:</b> I think nature is beautiful because it chaotically follows rules. I wanted to interact with my instrument like I would explore nature. Sound selections, configurations and names creation are influenced by scoped randomness.<br><br><b>Challenge:</b> FL Studio is a black box not made to be programmatically interacted with, but that didn't stop me and I experimented with many techniques and technologies. I used Human Interface Devices as controllers, sent data between processes through Midi busses and analyzed FL Studio's state through pixel colors, window data and Optical Character Recognition. If I was Frankenstein, this would be my monster. One doesn't realize the importance of code quality until their project is big enough. When I was approached to sell modules from this project, I was glad I had taken time to split configuration from logic, but not everything was perfect and I could never forget the lessons this project taught me.",
			"repo": "https://github.com/francoismartineau/FLahk"
		}
	},
	{
		"title": "Philosophers",
		"text": "An exercise completed as part of my studies at 42 Québec where N threads must share ressources fairly with high precision. The implementation involved working with threads, mutexes, forks and semaphores.<br><br>(C)",
		"image": "https://i.postimg.cc/c15mqXRq/Screen-Shot-2024-01-05-at-11-28-12-AM.png",
		"repo": "https://github.com/francoismartineau/42Philosophers"
	},
	{
		"title": "ft_irc",
		"text": "A chat server that follows the IRC protocol, compatible with any IRC client. Our tester simulates intense stress and was essential to ensure robustness. Developed in collaboration with two colleagues at 42 Québec.<br><br>(C++)",
		"image": "https://i.postimg.cc/XNs0RG7G/irc.gif",
		"repo": "https://github.com/emgervais/ft_irc"
	}
]
